{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js v3.18.0",
  "convertedBy": "TensorFlow.js Converter v3.18.0",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "mnist_digit_recognition_model",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [null, 28, 28, 1],
            "dtype": "float32",
            "sparse": false,
            "name": "input_1"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_1",
            "trainable": true,
            "filters": 32,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "valid",
            "activation": "relu"
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_1",
            "trainable": true,
            "pool_size": [2, 2],
            "strides": [2, 2],
            "padding": "valid"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_2",
            "trainable": true,
            "filters": 64,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "valid",
            "activation": "relu"
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_2",
            "trainable": true,
            "pool_size": [2, 2],
            "strides": [2, 2],
            "padding": "valid"
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten_1",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "units": 128,
            "activation": "relu"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "units": 10,
            "activation": "softmax"
          }
        }
      ]
    },
    "keras_version": "2.6.0",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": []
    }
  ]
} 